server/app/controllers/api/v1/accounts_controller.rb

INSERT INTO "accounts" ("first_name", "last_name", "address", "phone", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["first_name", "john"], ["last_name", "Doe"], ["address", "1111"], ["phone", "1111"], ["user_id", 7], ["created_at", "2020-07-23 16:43:03.581359"], ["updated_at", "2020-07-23 16:43:03.581359"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 7]]
---
  def create
    account = Account.new(account_params)

    if account.valid?
      account.save
      render json: User.find(account.user.id)

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "accounts" SET "first_name" = $1, "last_name" = $2, "address" = $3, "phone" = $4, "updated_at" = $5 WHERE "accounts"."id" = $6  [["first_name", "6"], ["last_name", "jane"], ["address", "111"], ["phone", "doe"], ["updated_at", "2020-07-23 18:18:02.797641"], ["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = $1  [["user_id", 7]]
---
  def update
    account = Account.find(params[:id])
    account.update(account_params)
    render json: User.find(account.user.id)