server/app/controllers/api/v1/items_controller.rb

UPDATE "items" SET "price" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["price", "2"], ["updated_at", "2020-07-29 23:09:47.962519"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def create

        hash = item_params[:price].each do |k, v| [k, v] end

        hash.map{|k,v| Item.update(k, :price => v)}

        render json: User.find(params['id'])