server/app/controllers/api/v1/orders_controller.rb

    def create
      hash = order_params[:orders].each do |k, v| [k, v] end

      ticket = Ticket.create(:account_id => params['id'])

      hash.map{|k,v| Order.create(:item => v['name'], :cost => v['price'], :description=>v['description'], :ticket_id=>ticket.id, :item_type=>v['item_type'])}

      render json: User.find(params['id']), :include => :tickets
---
INSERT INTO "tickets" ("account_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["account_id", 2], ["created_at", "2020-07-29 23:10:31.821806"], ["updated_at", "2020-07-29 23:10:31.821806"]]
INSERT INTO "orders" ("item", "cost", "item_type", "description", "ticket_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "tickets".* FROM "tickets" INNER JOIN "accounts" ON "tickets"."account_id" = "accounts"."id" WHERE "accounts"."user_id" = $1  [["user_id", 2]]