server/app/controllers/api/v1/users_controller.rb

  def create
    user = User.new(user_params)

    if user.valid?

      user.save

      items = Items.new
      items.items.map{|item| Item.create(name:item[:name], item_type:item[:item_type], price:item[:price], user_id:user.id)}
---
INSERT INTO "users" ("username", "password_digest", "company", "phone", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "users".* FROM "users"
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1  [["user_id", 2]]
INSERT INTO "items" ("name", "item_type", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "shirt"], ["item_type", "laundry"], ["price", "0.0"], ["user_id", 2], ["created_at", "2020-07-29 23:03:07.334732"], ["updated_at", "2020-07-29 23:03:07.334732"]]

  def update
    user = User.find(params[:id])
    user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "company" = $2, "address" = $3, "phone" = $4, "updated_at" = $5 WHERE "users"."id" = $6  [["username", "new11"], ["company", "stuffff"], ["address", "1111"], ["phone", "1111"], ["updated_at", "2020-07-23 14:17:59.620147"], ["id", 7]]